CommunityGD32Cores/ArduinoCore-GD32/variants/GD32F103ZC_GENERIC/PeripheralPins.c
/* SPI_MISO PinMap */
const PinMap PinMap_SPI_MISO[] = {
    {PORTA_6,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI0_MISO */
    {PORTB_4,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI0_MISO */
    {PORTB_4_ALT1,  SPI2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI2_MISO */
    {PORTB_14,      SPI1, GPIO_MODE_AF_PP},        /* SPI1_MISO */
    {PORTC_11,      SPI2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI2_MISO */
    {NC,   NC,    0}
};

/* SPI_SCLK PinMap */
const PinMap PinMap_SPI_SCLK[] = {
    {PORTA_5,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI0_SCK */
    {PORTB_3,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI0_SCK */
    {PORTB_13,      SPI1, GPIO_MODE_AF_PP},        /* SPI1_SCK */
    {NC,   NC,    0}
};

/* SPI_SSEL PinMap */
const PinMap PinMap_SPI_SSEL[] = {
    {PORTA_4,       SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI0_NSS */
    {PORTA_4_ALT1,  SPI2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI2_NSS */
    {PORTA_15,      SPI0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, SPI0_REMAP)}, /* SPI0_NSS */
    {PORTA_15_ALT1, SPI2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OTYPE_PP, PIN_PUPD_PULLUP, DISABLE_SPI0_REMAP)}, /* SPI2_NSS */
    {PORTB_12,      SPI1, GPIO_MODE_AF_PP},        /* SPI1_NSS */
    {NC,   NC,    0}
};

/* CAN_RD PinMap */
const PinMap PinMap_CAN_RD[] = {
    {PORTA_11,      CAN0, GPIO_MODE_AF_PP},        /* CAN0_RX */
    {PORTB_8,       CAN0, GPIO_MODE_AF_PP},        /* CAN0_RX */
    {PORTD_0,       CAN0, GPIO_MODE_AF_PP},        /* CAN0_RX */
    {NC,   NC,    0}
};

/* CAN_TD PinMap */
const PinMap PinMap_CAN_TD[] = {
    {PORTA_12,      CAN0, GPIO_MODE_AF_PP},        /* CAN0_TX */
    {PORTB_9,       CAN0, GPIO_MODE_AF_PP},        /* CAN0_TX */
    {PORTD_1,       CAN0, GPIO_MODE_AF_PP},        /* CAN0_TX */
    {NC,   NC,    0}
};

